wstars1994/nes-simulator/nes_c_stm32/Core/Src/nes.c
//
// Created by WStars on 2021/9/1.
//
#include <stdio.h>
#include <stm32f4xx_ll_dma.h>
#include "nes.h"
#include "ILI9341.h"
//#include "stm32f4xx_ll_usart.h"

//#include "sdcard.h"
//RGB16位(565)颜色
uint16_t palettes[65] = {29614, 8401, 21, 16403, -30706, -22526, -24576, 30784, 16736, 544, 640, 482, 6635, 0, 32, 32,
                      -16905, 925, 8669, -32738, -18409, -8181, -9920, -13727, -29824, 1184, 1344, 1159, 1041, 4226,
                      2113, 2113, -1, 15871, 23743, -23457, -3105, -1098, -1108, -825, -2585, -31102, 20201, 24531,
                      1883, 25388, 2145, 2145, -1, -20673, -14657, -10657, -449, -453, -522, -299, -204, -6156, -20585,
                      -18439, -24578, -8453, 4226, 4226, 0,};

//int _write(int file, char* ptr, int len)
//{
//    for (int i = 0; i != len; ++i){
//        LL_USART_TransmitData8(USART1,*ptr++);
//        LL_mDelay(0);
//    }
//    return len;
//}

byte get_bit(byte data, byte index) {
    return (data >> index) & 1;
}

void set_bit(byte *data, byte set_data, byte index) {
    if (set_data) {
        *data |= 1 << index;
    } else {
        *data &= ~(1 << index);
    }
}

long count = 0;

int prgPc = 0x8000;
//状态寄存器
byte flag_n = 0, flag_v = 0, flag_b = 1, flag_d = 0, flag_i = 1, flag_z = 0, flag_c = 0;
//CPU寄存器
byte c_reg_a, c_reg_x, c_reg_y, c_reg_s = 0xFF;
//CPU内存
byte c_mem[0x800];
//PPU寄存器
byte p_reg_2000, p_reg_2001, p_reg_2002, p_reg_2003, p_reg_2007, p_write_toggle = 0, p_scroll_x;
//PPU内存
byte p_mem[0x2000];
//精灵数据
byte p_spr_ram[256];

short p_vram_addr, p_vram_temp_addr;
short frameData[240][3];
byte frameSpriteData[240][2];

uint16_t render[256 * 120];

int program_length;

//读取程序指令
byte read_program(int addr) {
    if (addr < 0x8000) {
        return c_mem[addr];
    } else {
        int start_addr = addr - 0x8000;
        return *(__IO uint8_t *) (0x08020010 + start_addr);
    }
}

//标志位操作
void set_i(byte flag) {
    flag_i = flag;
}

void set_d(byte flag) {
    flag_d = flag;
}

void set_n(byte flag) {
    flag_n = get_bit(flag, 7);
}

void set_z(byte flag) {
    flag_z = flag == 0;
}

void set_nz(byte flag) {
    set_n(flag);
    set_z(flag);
}

void set_v(byte flag) {
    flag_v = flag;
}
//PPU操作---------------------------
byte p_read(short addr) {
    if (addr < 0x2000) {
        return *(__IO uint8_t *) (0x08020010 + program_length + addr);
    }
    return p_mem[addr - 0x2000];
}

void p_write(short addr, byte data) {
    //写入 $3F00-3FFF 的 D7-D6 字节被忽略.
    if (addr >= 0x3F00 && addr <= 0x3FFF) {
        data = data & 0x3f;
        if (addr == 0x3F00) {
            p_mem[0x3F10 - 0x2000] = data;
        } else if (addr == 0x3F10) {
            p_mem[0x3F00 - 0x2000] = data;
        }
    }
    //printf(" | PWR:[addr:%02X INDEX:%d DATA:%d]",addr&0xFFFF,addr&0xFFFF,data);
    p_mem[addr - 0x2000] = data;
}

void p_write_spr(byte addr, byte data) {
    p_spr_ram[addr & 0xFF] = data;
}

int showBg() {
    return get_bit(p_reg_2001, 3);
}

int showSpr() {
    return get_bit(p_reg_2001, 4);
}

//内存操作----------------------------------
byte read(int addr) {
    //printf(" | RD:[addr:%02X INDEX:%d]",addr,addr);
    byte ret_p_reg_2002;
    int temp_p_reg_2006;
    switch (addr) {
        //读PPUSTATUS状态寄存器
        case 0x2002:
            ret_p_reg_2002 = p_reg_2002;
            set_bit(&p_reg_2002, 0, 7);
            p_write_toggle = 0;
            return ret_p_reg_2002;
        case 0x2007:
            temp_p_reg_2006 = p_vram_addr & 0x3fff;
            p_vram_addr += get_bit(p_reg_2000, 2) ? 32 : 1;
            if (addr <= 0x3EFF) {
                //读取PPU
                byte res = p_reg_2007;
                p_reg_2007 = p_read(temp_p_reg_2006);
                return res;
            }
            break;
        default:
            return read_program(addr);
    }

}

void write(int addr, byte data) {
    //printf(" | WR:[ADDR:%02X INDEX:%d DATA:%d]",addr&0xFFFF,addr&0xFFFF,data);
    short start;
    switch (addr) {
        case 0x2000:
            p_reg_2000 = data;
            p_vram_temp_addr = (p_vram_temp_addr & 0xf3ff) | ((data & 3) << 10);
            break;
        case 0x2001:
            p_reg_2001 = data;
            break;
        case 0x2003:
            p_reg_2003 = data;
            break;
        case 0x2004:
            p_reg_2003 += 1;
            p_write_spr(p_reg_2003, data);
            break;
        case 0x2005:
            if (!p_write_toggle) {
                //设置fine_x
                p_scroll_x = data & 0x7;
                //设置coarse_x
                p_vram_temp_addr &= ~0x1F;
                p_vram_temp_addr |= ((data & 0xff) >> 3) & 0x1F;
            } else {
                //设置coarse_y
                p_vram_temp_addr &= ~0x3E0;
                p_vram_temp_addr |= (((data & 0xff) >> 3) << 5);
                //设置fine_y
                p_vram_temp_addr &= ~0x7000;
                p_vram_temp_addr |= (data & 0x7) << 12;
            }
            p_write_toggle = !p_write_toggle;
            break;
        case 0x2006:
            if (!p_write_toggle) {
                //高6位置0 PPU高7/8位无效 置0
                p_vram_temp_addr &= ~(0xFF << 8);
                //第一次写将写入高6位;
                p_vram_temp_addr |= ((data & 0x3F) << 8);
            } else {
                //低8位置0
                p_vram_temp_addr &= ~0xFF;
                //第二次写将写入低8位
                p_vram_temp_addr |= data & 0xFF;
                p_vram_addr = p_vram_temp_addr;
            }
            p_write_toggle = !p_write_toggle;
            break;
        case 0x2007:
            p_write(p_vram_addr, data);
            p_vram_addr += get_bit(p_reg_2000, 2) ? 32 : 1;
            break;
            //OAM DMA register (high byte)
        case 0x4014:
            start = data << 8;
            for (int i = 0; i < 256; i++) {
                byte readData = read(start++);
                p_write_spr(i, readData);
            }
            break;
        default:
            c_mem[addr & 0xFFFF] = data;
    }
}

//指令操作---------------------------
int concat16(byte low, byte high) {
    return (low & 0xFF) | ((high & 0xff) << 8);
}

int ams_branch(byte data, int branch) {
    byte cpu_cycle = 2;
    if (branch) {
        cpu_cycle += (prgPc & 0xff00) == ((prgPc + data) & 0xff00) ? 1 : 2;
        prgPc += data;
    }
    return cpu_cycle;
}

void ams_immed(byte *reg) {
    *reg = read_program(prgPc++);
}

int ams_abs() {
    byte low = read_program(prgPc++);
    byte high = read_program(prgPc++);
    return concat16(low, high);
}

int ams_abs_x(byte reg) {
    return ams_abs() + (reg & 0xff);
}

int ams_zero(byte addr, byte reg) {
    return (addr & 0XFF) + (reg & 0xff);
}

void ams_adc(byte data) {
    int abs_data = (c_reg_a & 0xff) + (data & 0xff) + (flag_c & 0xff);
    flag_c = abs_data >> 8;
    set_nz(abs_data & 0xff);
    flag_v = ((c_reg_a ^ data) & 0x80) == 0 && ((c_reg_a ^ abs_data) & 0x80) != 0;
    c_reg_a = abs_data & 0xff;
}

