wstars1994/nes-simulator/nes_c_stm32/Core/Src/nes.c
                addr = ams_zero(read_program(prgPc++), c_reg_x);
                data = read(addr) + 1;
                write(addr, data);
                set_nz(data);
                cpu_cycle -= 6;
                break;
                //ORA_ZERO_X
            case 0x15:
                addr = read_program(prgPc++);
                ams_ora(read(addr));
                cpu_cycle -= 4;
                break;
                //BVC
            case 0x50:
                data = read_program(prgPc++);
                cpu_cycle -= ams_branch(data, !flag_v);
                break;
                //SBC_ABS_X
            case 0xFD:
                addr = ams_abs_x(c_reg_x);
                ams_sbc(read(addr));
                cpu_cycle -= 4;
                break;
                //CPY_ZERO
            case 0xC4:
                data = read(read_program(prgPc++) & 0xFF);
                ams_cpy(data);
                cpu_cycle -= 3;
                break;
                //ORA_INDIRECT_Y
            case 0x11:
                ams_ora(indirect_y());
                cpu_cycle -= 5;
                break;
                //ORA_ABS_Y
            case 0x19:
                addr = ams_abs_x(c_reg_y);
                ams_ora(read(addr));
                cpu_cycle -= 4;
                break;
                //ADC_INDIRECT_Y
            case 0x71:
                ams_adc(indirect_y());
                cpu_cycle -= 5;
                break;
                //ORA_ABS_X
            case 0x1D:
                addr = ams_abs_x(c_reg_x);
                ams_ora(read(addr));
                cpu_cycle -= 4;
                break;
                //CMP_INDIRECT_Y
            case 0xD1:
                ams_cmp(indirect_y());
                cpu_cycle -= 5;
                break;
                //SBC_INDIRECT_Y
            case 0xF1:
                ams_sbc(indirect_y());
                cpu_cycle -= 5;
                break;
                //LDA_INDIRECT_X
            case 0xA1:
                ams_lda(indirect_x());
                cpu_cycle -= 6;
                break;
                //STA_INDIRECT_X
            case 0x81:
                st_x(indirect_x() & 0xff, c_reg_a);
                cpu_cycle -= 6;
                break;
                //INC_ABS_X
            case 0xFE:
                addr = ams_abs_x(c_reg_x);
                data = read(addr) + 1;
                write(addr, data);
                set_nz(data);
                cpu_cycle -= 7;
                break;
                //CPY_ABS
            case 0xCC:
                addr = ams_abs();
                ams_cpy(read(addr));
                cpu_cycle -= 4;
                break;
                //ROR
            case 0x66:
                ams_ror(read_program(prgPc++) & 0xff);
                cpu_cycle -= 5;
                break;
                //ROR_ABS
            case 0x6E:
                ams_ror(ams_abs());
                cpu_cycle -= 6;
                break;
                //BVS
            case 0x70:
                cpu_cycle -= ams_branch(read_program(prgPc++), flag_v);
                break;
                //ROL_ABS_X
            case 0x3E:
                ams_rol(ams_abs_x(c_reg_x));
                cpu_cycle -= 7;
                break;
                //ASL_ABS_X
            case 0x1E:
                ams_asl(ams_abs_x(c_reg_x));
                cpu_cycle -= 7;
                break;
                //EOR_ABS_X
            case 0x5D:
                ams_eor_a(read(ams_abs_x(c_reg_x)));
                cpu_cycle -= 4;
                break;
                //CPX_ABS
            case 0xEC:
                ams_cpx(read(ams_abs()));
                cpu_cycle -= 4;
                break;
                //ROR_ZERO_X
            case 0x76:
                ams_ror(ams_zero(read_program(prgPc++), c_reg_x));
                cpu_cycle -= 6;
                break;
                //LSR_ZERO_X
            case 0x56:
                ams_lsr(ams_zero(read_program(prgPc++), c_reg_x));
                cpu_cycle -= 6;
                break;
                //ROL_ZERO_X
            case 0x36:
                ams_rol(ams_zero(read_program(prgPc++), c_reg_x));
                cpu_cycle -= 6;
                break;
                //LDX_ZERO_Y
            case 0xB6:
                c_reg_x = read(ams_zero(read_program(prgPc++), c_reg_y));
                set_nz(c_reg_x);
                cpu_cycle -= 4;
                break;
                //EOR_INDIRECT_Y
            case 0x51:
                ams_eor_a(indirect_y());
                cpu_cycle -= 5;
                break;
                //STX_ZERO_Y
            case 0x96:
                st_x(ams_zero(read_program(prgPc++), c_reg_y), c_reg_x);
                cpu_cycle -= 4;
                break;
                //CLI
            case 0x58:
                flag_i = 0;
                cpu_cycle -= 2;
                break;
                //LSR_ABS_X
            case 0x5E:
                ams_lsr(ams_abs_x(c_reg_x));
                cpu_cycle -= 7;
                break;
            default:
                cpu_cycle -= 0;
                //printf("unknown ins %X\n", opc & 0xFF);
                break;
        }
        //printf("\r\n");
    }
}

void coarseY() {
    if (showBg() || showSpr()) {
        // if fine Y < 7
        if ((p_vram_addr & 0x7000) != 0x7000) {
            // increment fine Y
            p_vram_addr += 0x1000;
        } else {
            // fine Y = 0
            p_vram_addr &= ~0x7000;
            // let y = coarse Y
            int y = (p_vram_addr & 0x03E0) >> 5;
            if (y == 29) {
                // coarse Y = 0
                y = 0;
                // switch vertical nametableelse if (y == 31)
                p_vram_addr ^= 0x0800;
            } else if (y == 31) {
                // coarse Y = 0, nametable not switched
                y = 0;
            } else {
                // increment coarse Y
                y += 1;
            }
            // put coarse Y back into v
            p_vram_addr = (p_vram_addr & ~0x03E0) | (y << 5);
        }
    }
}

void NES_Start() {
    int rom_prg_size = *(__IO uint8_t *) (0x08020004);
    int rom_chr_size = *(__IO uint8_t *) (0x08020005);
    program_length = 16 * 1024 * rom_prg_size;
    LCD_SetRegion(35, 0, 256, LCD_HEIGHT);
    int i=0;
    while (1) {
        for (int l = 0; l < 240; l++) {
            if (showBg() || showSpr()) {
                p_vram_addr = (p_vram_addr & 0xfbe0) | (p_vram_temp_addr & 0x041f);
            }
            ppu_render(l);
            exec_instruction();
            coarseY();
        }
        if ((showBg() || showSpr())&&i==1) {
            LCD_CS_CLR
            LCD_DC_SET
            for (int i = 0; i < 2; ++i) {
                render_name_table(i);
                for (int j = 0; j < 30720; ++j) {
                    LCD_WR_POINT(render[j]);
                }
            }
            LCD_CS_SET
//            LL_USART_TransmitData8(USART1,1);
        }

        if(i==2){
            i=0;
        }else{
            i++;
        }
        //设置vblank true
        set_bit(&p_reg_2002, 1, 7);
        set_bit(&p_reg_2002, 0, 6);
        exec_instruction();
        //NMI中断
        interrupt_nmi();
        //242-260
        for (int i = 242; i < 262; i++) {
            exec_instruction();
        }
        set_bit(&p_reg_2002, 0, 7);
        //vblank结束后 如果有渲染 将t复制到v
        if (showBg() || showSpr()) {
            p_vram_addr = p_vram_temp_addr;
        }
    }
}